function setup() {
  createCanvas(400, 600);
  background(230, 225, 215);
  fill(242, 215, 186); //피부
  noStroke();
  rect(160, 370, 80, 200); //목
  rect(55, 530, 50, 90); //왼팔
  rect(295, 530, 50, 90); //오른팔
  fill('#788CB4'); //파란 티셔츠
  arc(200, 420, 220, 180, 0, PI); //어깨
  rect(100, 450, 200, 200); //몸통
  ellipse(103, 440, 70, 40); //왼쪽 소매
  ellipse(100, 455, 70, 40);
  ellipse(97, 470, 70, 40);
  ellipse(94, 485, 70, 40);
  ellipse(91, 500, 70, 40);
  ellipse(88, 515, 70, 40);
  ellipse(85, 530, 70, 40);
  ellipse(297, 440, 70, 40); //오른쪽 소매
  ellipse(300, 455, 70, 40);
  ellipse(303, 470, 70, 40);
  ellipse(306, 485, 70, 40);
  ellipse(309, 500, 70, 40);
  ellipse(312, 515, 70, 40);
  ellipse(315, 530, 70, 40);
  fill('#D2AA6E'); //곰돌이 얼굴
  ellipse(200, 520, 40, 36);
  ellipse(185, 505, 16, 16); //곰돌이 왼쪽 귀
  ellipse(215, 505, 16, 16); //곰돌이 오른쪽 귀
  fill('#B48C5A'); //귀 안쪽
  ellipse(185, 505, 10, 10);
  ellipse(215, 505, 10, 10);
  fill(60);
  ellipse(193, 516, 5, 5); //곰돌이 눈
  ellipse(207, 516, 5, 5);
  fill(40);
  ellipse(200, 523, 6, 4); //곰돌이 코
  fill(242, 215, 186); //얼굴
  stroke(200, 175, 150);
  strokeWeight(1);
  ellipse(200, 280, 160, 200);
  ellipse(118, 280, 28, 40); //왼쪽 귀
  ellipse(282, 280, 28, 40); //오른쪽 귀
  fill(245, 245, 248); //버즈 
  stroke(220, 220, 225);
  ellipse(111, 284, 13, 14);
  noStroke();
  fill(235, 235, 240);
  rect(106, 286, 10, 14, 3); //버즈 아래 부분
  fill(40, 32, 25); //머리 스타일
  arc(200, 218, 170, 120, PI, 0); //윗머리
  quad(130, 210, 160, 195, 240, 195, 275, 225); //앞머리
  quad(160, 195, 240, 195, 265, 220, 270, 240); //앞머리 오른쪽
  rect(250, 220, 22, 30, 3); //오른쪽 머리 끝
  rect(130, 210, 20, 30, 2); //왼쪽 짧은 머리
  rect(120, 218, 16, 45, 2); //왼쪽 옆머리
  rect(264, 218, 16, 45, 2); //오른쪽 옆머리
  noFill(); //눈썹
  stroke(120, 100, 85);
  strokeWeight(2);
  arc(170, 262, 42, 14, PI, 0); //왼쪽 눈썹
  arc(232, 262, 42, 14, PI, 0); //오른쪽 눈썹
  fill(255); //눈
  noStroke();
  ellipse(170, 278, 26, 19); //왼쪽 흰자
  ellipse(232, 278, 26, 19); //오른쪽 흰자
  fill(50, 30, 18);
  ellipse(170, 279, 14, 16); //왼쪽 홍채
  ellipse(232, 279, 14, 16); //오른쪽 홍채
  fill(0);
  ellipse(170, 279, 7, 7); //왼쪽 눈동자
  ellipse(232, 279, 7, 7); //오른쪽 눈동자
  fill(255);
  ellipse(173, 276, 3, 3); //왼쪽 눈 반짝임
  ellipse(235, 276, 3, 3); //오른쪽 눈 반짝임
  noFill(); //코
  stroke('#DCCBAA');
  strokeWeight(1.5);
  arc(200, 315, 18, 10, 0, PI);
  fill('#C8826E'); //입
  noStroke();
  arc(200, 343, 34, 12, 0, PI);
}
